project_sk/app/Controllers/Dashboard.php

SELECT *
FROM `pengajuan`
---
    public function admin()
{
    $id_admin = session()->get('id');
    $model = new AdminModel();
    $laporan = $model->getLaporanPenerbitan();

    // Tambahkan data pengajuan
    $pengajuanModel = new PengajuanSkModel();
    $pengajuan = $pengajuanModel->findAll();

SELECT *
FROM `pengajuan`
WHERE `pengajuan`.`id_sk` = '6'
---
    public function cetakLaporan($id_sk)
{

    $pengajuanModel = new PengajuanSkModel();

    // Ambil data pengajuan berdasarkan id_sk
    $data['pengajuan'] = $pengajuanModel->find($id_sk);