project_sk/app/Models/AdminModel.php

    public function getLaporanPenerbitan()
    {
        return $this->db->table('laporan_penerbitan_sk')->get()->getResultArray();
---
SELECT *
FROM `laporan_penerbitan_sk`