project_sk/app/Models/loginmodel.php

SELECT *
FROM `login`
WHERE `id_admin` = '412321'
 LIMIT 1
SELECT *
FROM `login`
WHERE `id_pengaju` = '412321'
 LIMIT 1
SELECT *
FROM `login`
WHERE `id_staff` = '412321'
 LIMIT 1
SELECT *
FROM `login`
WHERE `id_pimpinan` = '412321'
 LIMIT 1
---
    public function getUser($id)
{
    $user = $this->where('id_admin', $id)
                ->first();
    if (!$user) {
        $user = $this->where('id_pengaju', $id)
                    ->first();
    }
    if (!$user) {
        $user = $this->where('id_staff', $id)
                    ->first();
    }
    if (!$user) {
        $user = $this->where('id_pimpinan', $id)
                    ->first();