project_sk/app/Models/PengajuanSKModel.php

    public function getPengajuanWithStatus($id_pengaju)
{
    return $this->db->table('pengajuan')
                    ->select('pengajuan.*, melihat_status.status')
                    ->join('melihat_status', 'pengajuan.id_sk = melihat_status.id_sk', 'left')
                    ->where('pengajuan.id_pengaju', $id_pengaju)
                    ->get()
                    ->getResultArray();
---
SELECT `pengajuan`.*, `melihat_status`.`status`
FROM `pengajuan`
LEFT JOIN `melihat_status` ON `pengajuan`.`id_sk` = `melihat_status`.`id_sk`
WHERE `pengajuan`.`id_pengaju` = '321412'