project_sk/app/Models/PengajuanSKModel.php

SELECT *
FROM `pengajuan`
WHERE `id_pengaju` = '321412'
---
    public function getByPengaju($id_pengaju)
    {
        // Mengambil semua pengajuan SK yang terkait dengan id_pengaju
        return $this->where('id_pengaju', $id_pengaju)->findAll();