project_sk/app/Models/PimpinanModel.php

SELECT *
FROM `persetujuan_sk`
WHERE `jenis_keputusan` IS NULL
---
    public function getVerifiableSKs()
    {
        return $this->db->table('persetujuan_sk')
            ->where('jenis_keputusan IS NULL')
            ->get()
            ->getResultArray();

SELECT *
FROM `laporan_penerbitan_sk`
---
    public function getLaporanSK()
    {
        return $this->db->table('laporan_penerbitan_sk')->get()->getResultArray();